/////////////////////////////////////////////////////////////////////////////////////////////
//文件名：		CBNSumProduct.cpp
//功  能：		实现贝叶斯网络的精确推理类。采用和积变量消除法
//开发者：		高志强
//日  期：		2021年02月28日
//更  新：		2021年03月08日
//更  新：		2021年03月23日
//长  度：		30行
/////////////////////////////////////////////////////////////////////////////////////////////
#include "stdafx.h"									//MFC标准头文件
#include "CBNSumProduct.h"							//贝叶斯网络的精确推理类头文件


//名  称：		CBNSumProduct()
//功  能：		构造函数
//参  数：		无
//返回值：		无
CBNSumProduct::CBNSumProduct()
{
}

//名  称：		~CBNSumProduct()
//功  能：		析构函数
//参  数：		无
//返回值：		无
CBNSumProduct::~CBNSumProduct()
{
}