/////////////////////////////////////////////////////////////////////////////////////////////
//文件名：		CFactor.cpp
//功  能：		实现因子类
//开发者：		高志强
//日  期：		2021年03月12日
//更  新：		2021年03月23日
//更  新：		2021年03月29日
//长  度：		30行
/////////////////////////////////////////////////////////////////////////////////////////////
#include "stdafx.h"									//MFC标准头文件
#include "CFactor.h"								//因子类头文件


//名  称：		CFactor()
//功  能：		构造函数
//参  数：		无
//返回值：		无
CFactor::CFactor()
{
}

//名  称：		~CFactor()
//功  能：		析构函数
//参  数：		无
//返回值：		无
CFactor::~CFactor()
{
}